In [53]:
import pandas as pd
import numpy as np
import seaborn as sns

In [54]:
#load file

In [55]:
user = pd.read_csv("C:/Users/default.LAPTOP-E7URUV4I/Desktop/IAU/Project/user.csv", sep='\t')

In [56]:
#get basic sense about users in user.csv

In [57]:
user.shape

(2579, 11)

In [58]:
#we see that the user.csv file has 11 comuns and 2579 rows

In [138]:
user.head()

,job,birthdate,name,sex,address,residence,username,registration,user_id,mail,race
0,"Nurse, children's",1965-08-08,Ludmila Šimková,F,Bořetínská 20\n481 76 Polná,Konžská 16\n405 90 Borohrádek,vladimirablahova,"09/18/2020, 00:00:00",782,hajekadam@chello.cz,NaN
1,NaN,NaN,Fabrizia Beccaria,NaN,"Stretto Zarlino, 87\n10039, Pecco (TO)",NaN,paloma33,14 May 2021,2158,silvioiacobucci@libero.it,NaN
2,NaN,NaN,João Alves,NaN,"Passarela de Jesus, 33\nPirineus\n19889610 Cav...",NaN,eduardoda-rosa,2017/06/23,747,beniciocampos@yahoo.com.br,NaN
3,"Exhibitions officer, museum/gallery",2003-02-24,Zdeňka Krejčová,F,Novákovo Náměstí 2\n582 33 Protivín,NaN,jandovanela,2019/05/16,2204,jelinkovapetra@email.cz,NaN
4,NaN,NaN,Juan Cunha,NaN,"Área Melo, 55\nDom Cabral\n03392-450 Ferreira ...",NaN,lara09,2019/10/28,720,stella46@bol.com.br,NaN

In [139]:
user.describe()

           user_id
count  2579.000000
mean   1284.920124
std     727.080732
min       0.000000
25%     675.000000
50%    1285.000000
75%    1918.000000
max    2578.000000

In [140]:
user.nunique()

job              604
birthdate       1401
name            2525
sex                2
address         2192
residence        903
username        2546
registration    2369
user_id         1626
mail            2573
race               5
dtype: int64

In [141]:
#we have a problem! the user_ids range from 0-2578 but there are only 1626
#unique user_ids
#TODO what does that mean?

In [142]:
#now we analyse how many columns include null values

In [143]:
user.isnull().sum()

job             1547
birthdate       1161
name               0
sex             1290
address          387
residence       1676
username           0
registration       0
user_id            0
mail               0
race            1805
dtype: int64

In [144]:
null_counts = user.isnull().sum()
total_records = user.shape[0]
percentage_null = (null_counts / total_records) * 100
pd.DataFrame({'Column Name': percentage_null.index, 'Percentage Null': percentage_null.values})

     Column Name  Percentage Null
0            job        59.984490
1      birthdate        45.017449
2           name         0.000000
3            sex        50.019387
4        address        15.005816
5      residence        64.986429
6       username         0.000000
7   registration         0.000000
8        user_id         0.000000
9           mail         0.000000
10          race        69.988368

In [145]:
#it is adviced to drop the values or replace the values if the null amount 
#exceeds 2%

In [146]:
#in our dataset we can see that the required information in user registration 
#are 'name', 'username', 'registration', 'user_id' and 'mail'

In [147]:
#should we drop all the data in other columns?

In [148]:
#the most important data to collect from costumrs to know your 
#costumer demographics are:
#age
#gender
#location
#ethnicity

In [149]:
#in my opinion we don't need the columns 'job', 'name', adress', 'residence'
#'username',

#so let's just delete it

In [183]:
user_reduced = user.drop(['job', 'name', 'username', 'address', 'residence'], axis = 1)

In [184]:
user_reduced.head()

,birthdate,sex,registration,user_id,mail,race
0,1965-08-08,F,"09/18/2020, 00:00:00",782,hajekadam@chello.cz,NaN
1,NaN,NaN,14 May 2021,2158,silvioiacobucci@libero.it,NaN
2,NaN,NaN,2017/06/23,747,beniciocampos@yahoo.com.br,NaN
3,2003-02-24,F,2019/05/16,2204,jelinkovapetra@email.cz,NaN
4,NaN,NaN,2019/10/28,720,stella46@bol.com.br,NaN

In [185]:
#let's clen the data

In [186]:
#we'll start with the bithdate column

In [187]:
#we extract only the year of birth from the buirthday column
user_reduced['birthdate'] = pd.to_datetime(user_reduced['birthdate'], errors='coerce')
user_reduced['birth_year'] = user_reduced['birthdate'].dt.year
user_reduced.drop(columns=['birthdate'], inplace=True)

In [188]:
#and fill in all the null values with the average of the birth years
mean_birth_year = user_reduced['birth_year'].mean()
user_reduced['birth_year'].fillna(round(mean_birth_year), inplace=True)
user_reduced['birth_year'] = user_reduced['birth_year'].astype('Int64')

In [189]:
user_reduced.head()

,sex,registration,user_id,mail,race,birth_year
0,F,"09/18/2020, 00:00:00",782,hajekadam@chello.cz,NaN,1965
1,NaN,14 May 2021,2158,silvioiacobucci@libero.it,NaN,1964
2,NaN,2017/06/23,747,beniciocampos@yahoo.com.br,NaN,1964
3,F,2019/05/16,2204,jelinkovapetra@email.cz,NaN,2003
4,NaN,2019/10/28,720,stella46@bol.com.br,NaN,1964

In [190]:
#let's attempt to extract the location of a user using the 'mail' column

In [191]:
#first of all we extract the county code from the email
user_reduced['country_code'] = user_reduced['mail'].str.split('@').str[1].str.split('.').str[-1]
user_reduced.drop(columns=['mail'], inplace=True)

In [192]:
user_reduced.head()

   sex          registration  user_id race  birth_year country_code
0    F  09/18/2020, 00:00:00      782  NaN        1965           cz
1  NaN           14 May 2021     2158  NaN        1964           it
2  NaN            2017/06/23      747  NaN        1964           br
3    F            2019/05/16     2204  NaN        2003           cz
4  NaN            2019/10/28      720  NaN        1964           br

In [193]:
#what counties do we have represented?
user_reduced['country_code'].unique()

array(['cz', 'it', 'br', 'com', 'de'], dtype=object)

In [194]:
#now we create a county map
country_mapping = {
    'cz': 'Czechia',
    'it': 'Italy',
    'br': 'Brazil',
    'com': 'Global',
    'de': 'Germany',
}

#and insert the county to the table
user_reduced['country'] = user_reduced['country_code'].map(country_mapping)
user_reduced.drop(columns=['country_code'], inplace=True)

In [195]:
user_reduced.head()

   sex          registration  user_id race  birth_year  country
0    F  09/18/2020, 00:00:00      782  NaN        1965  Czechia
1  NaN           14 May 2021     2158  NaN        1964    Italy
2  NaN            2017/06/23      747  NaN        1964   Brazil
3    F            2019/05/16     2204  NaN        2003  Czechia
4  NaN            2019/10/28      720  NaN        1964   Brazil

In [196]:
#let's continue and try to clen/fill the data about the race

In [197]:
#what races do we have?
user_reduced['race'].unique()

array([nan, 'unspecified', 'black', 'asian', 'white', 'indian'],
      dtype=object)

In [198]:
#which race is typical for what county?
user_reduced['race'] = user_reduced['race'].replace('unspecified', np.nan)
pivot_table = user_reduced.pivot_table(index='country', columns='race', aggfunc='size', fill_value=0)
pivot_table

race     asian  black  indian  white
country
Brazil      14     20       9     30
Czechia     35     24      13     23
Germany     12     18       6     23
Global      85     75      33     99
Italy       15     14       5     18

In [200]:
most_frequent_race = pivot_table.idxmax(axis=1)

result_df = pd.DataFrame({'County': most_frequent_race.index, 'Race': most_frequent_race.values})
result_df

    County   Race
0   Brazil  white
1  Czechia  asian
2  Germany  white
3   Global  white
4    Italy  white

In [204]:
#we create a couty-race mapping and fill in null values in 'race' column
country_race_mapping = {
    'Czechia': 'asian',
    'Italy': 'white',
    'Brazil': 'white',
    'Global': 'white',
    'Germany': 'white',
}

user_reduced['race'] = user_reduced['country'].map(country_race_mapping).fillna(user_reduced['race'])

In [205]:
user_reduced.head()

   sex          registration  user_id   race  birth_year  country
0    F  09/18/2020, 00:00:00      782  asian        1965  Czechia
1  NaN           14 May 2021     2158  white        1964    Italy
2  NaN            2017/06/23      747  white        1964   Brazil
3    F            2019/05/16     2204  asian        2003  Czechia
4  NaN            2019/10/28      720  white        1964   Brazil

In [ ]:
#let's continue with the column 'registration'. We want to extract the year